# Mac-only (no Linux checks, as you said you only use macOS)
# ------------------------------------------------------------------------------

# Homebrew taps
tap "homebrew/bundle"

# Core formulae
brew "atuin"
brew "bat"
brew "btop"
brew "docker"
brew "dockutil"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "neovim"
brew "python"
brew "ripgrep"
brew "stow"
brew "tldr"
brew "tmux"
brew "yarn"
brew "zoxide"
brew "zsh"

# LSP or additional dev tools
brew "shellcheck"
brew "shfmt"

# macOS formulae
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# casks
cask "1password"
cask "1password/tap/1password-cli"
cask "arc"
cask "docker"
cask "figma"
cask "font-symbols-only-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "kitty"
cask "nordvpn"
cask "postman"
cask "rectangle"
cask "spotify"
cask "wezterm"
